<a href="https://colab.research.google.com/github/tastiz/projects.py/blob/master/DataFrames.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [13]:
# Import the SQL ALchemy engine
from sqlalchemy import create_engine

# Database credentials
postgres_user = 'dabc_student'
postgres_pw = '7*.8G9QH21'
postgres_host = '142.93.121.174'
postgres_port = '5432'
postgres_db = 'baseball'

# use the credentials to start a connection
engine = create_engine('postgresql://{}:{}@{}:{}/{}'.format(
    postgres_user, postgres_pw, postgres_host, postgres_port, postgres_db))

import pandas as pd

sql = 'SELECT p.playerid, birthyear, birthcountry, deathyear, namefirst, namelast, weight, height, bats, throws, yearid, teamid, lgid, salary FROM people p join salaries s on p.playerid = s.playerid'

players_df = pd.read_sql_query(sql, con=engine)

engine.dispose()

players_df.describe()

players_df = players_df.assign(bmi = (703 * players_df.weight)/(players_df.height**2))

players_df['X'] = 0

players_df_changed = players_df.drop(['X'], axis = 1)

#print('The columns of the new DataFrame')
#print(players_df_changed.columns)

#print('The columns of the original DataFrame')
#print(players_df.columns)

players_df.drop(['X'], axis = 1, inplace=True)
#print('The columns of the DataFrame after deleting inplace')
#print(players_df.columns)

#select sepecific rows with iloc returning result in multiple rows
#players_df.iloc[0]

#double brackets returns the result as a list in a single row
#players_df.iloc[[0]]

    playerid  birthyear birthcountry  deathyear  ... teamid lgid  salary        bmi
0  barkele01       1955          USA        NaN  ...    ATL   NL  870000  26.678192

[1 rows x 15 columns]